package com.example.rgb;

public class AllRecepts {
    //salads
    //Классический салат "Цезарь"
    public static String[] classicsaladcesartext={"Нарвать и промыть листья салата, отложить в холодильник до подачи.",
            "Нагреть сковороду, растопить 1 столовую ложку сливочного масла. Положить пару зубчиков чеснока.",
    "Нарезать куриную грудку на кусочки приблизительно 4x5 см. Обжарить на сковороде около 10 минут до румяной корочки. Снять с огня.",
    "Нарезать хлеб на небольшие кубики и подсушить в духовке 5-10 минут на среднем огне (около 180 градусов).",
    "Достать листья салата, добавить нарезанные помидоры, курицу, соус «Цезарь» и перемешать. Натереть сыр пармезан и положить сухарики."};
    public static String classicsaladcesarimg="https://firebasestorage.googleapis.com/v0/b/mealfinderrgb.appspot.com/o/saladcesar.jpg?alt=media&token=97593bc6-ee40-4132-9672-bea7994e0dd6";
    public static String[] classicsaladcesarlist={"Куриная грудка","300 грамм","Салат","1 пучок","Помидор","3 штуки","Хлеб белый","200 грамм", "Сыр пармезан", "100 грамм","Чеснок","2 зубчика", "Сливочное масло", "1 ст. ложка"};
    public static String[] classicsaladcesarinfo={"Классический салат «Цезарь»","Обед","Американская кухня","30 мин"};

    //Салат «Цезарь» с креветками
    public static String[] saladcesarskrevetkitext={"Нарвать и промыть листья салата, отложить в холодильник до подачи.",
    "Нарезать хлеб на небольшие кубики и подсушить в духовке около 5-10 минут на среднем огне(приблизительно 180 градусов).",
    "Растопить сливочное масло на сковороде, положить пару зубчиков чеснока.",
    "Обжарить креветки на сковороде около 7-10 минут до румяной корочки.",
    "Вытащить листья салата, добавить нарезанные помидоры, креветки, соус «Цезарь» и перемешать. Натереть сыр пармезан и положить сухарики."};
    public static String saladcesarskrevetkamiimg="https://firebasestorage.googleapis.com/v0/b/mealfinderrgb.appspot.com/o/saladcesarskrevetkami.jpg?alt=media&token=26f27625-36d9-4c22-af26-98d386a79665";
    public static String[] saladcesarskrevetkamilist={"Креветки", "200 грамм", "Салат", "10 листов", "Помидор", "2 штуки", "Сыр пармезан", "100 грамм", "Хлеб белый", "200 грамм", "Чеснок", "2 зубчика", "Сливочное масло", "1 ст. ложка"};
    public static String[] saladcesarskrevetkamiinfo={"Салат «Цезарь» с креветками","Ужин","Американская кухня","35 мин"};

    //Классический салат «‎Оливье»
    public static String[] classicsaladolivyetext={"Отварить картофель и морковь в подсоленной воде. Яйца отварить отдельно. Нарезать все кубиками 5х5мм. Таким же образом нарезать ветчину.",
    "Смешать все ингредиенты и добавить мелко нарезанный зеленый лук и укроп. Заправить майонезом и поставить в холодильник.",
            "Нарезать соленые огурцы кубиками 5х5 мм.",
            "Добавить в салат соленые огурцы, зеленый горошек и всё перемешать. Соль и перец по вкусу."
    };
    public static String classicsaladolivyeimg="https://firebasestorage.googleapis.com/v0/b/mealfinderrgb.appspot.com/o/saladolivye.jpg?alt=media&token=770fadaa-76e5-4d95-8010-0cc5b055b103";
    public static String[] classicsaladolivyelist={"Картофель","510 грамм","Морковь","350 грамм","Огурцы солёные","150 грамм","Горошек зелёный","350 грамм","Яйцо куриное","5 штук","Колбаса варёная","420 грамм","Майонез","150 грамм","Лук зелёный","200 грамм"};
    public static String[] classicsaladolivyeinfo={"Классический салат «Оливье»", "Ужин", "Русская кухня", "60 мин"};

    //Классический греческий салат
    public static String[] greeksaladtext={"Сначала сделать заправку: вместе смешать оливковое масло, измельченный чеснок, соль, перец, лимонный сок и орегано. Тщательно перемешать.","" +
            "Нарезать небольшими дольками помидоры, огурцы, красный лук, зеленый перец. Положить все в одну миску, добавить маслины и нарезанный кубиками сыр фета.",
    "Полить заправкой и перемешать."};
    public static String greeksaladimg="https://firebasestorage.googleapis.com/v0/b/mealfinderrgb.appspot.com/o/greeksalad.jpg?alt=media&token=94478d9a-2ebc-4b12-b719-4a4508f03c4b";
    public static String[] greeksaladlist={"Помидор","300 грамм","Зеленый перец","150 грамм","Маслины","15 штук","Огурец","300 грамм","Сыр фета","250 грамм","Оливковое масло","1,5 ст. ложки","Красный лук","50 грамм"};
    public static String[] greeksaladinfo={"Греческий салат","Завтрак","Греческая кухня","20 мин"};
    //desserts

    //soups
    //Классический борщ
    public static String[] classicsoupborshtext={"Налейте в кастрюлю воду и выложите в неё мясо. Поставьте на средний огонь. Когда жидкость закипит, накройте кастрюлю крышкой и варите на медленном огне полтора часа.",
    "Делаем зажарку: вымойте и почистите свеклу, морковь и лук. Свеклу натрите на большой терке, морковь на средней, а лук нарежьте небольшими кубиками.",
    "Налейте масло в сковороду. Обжаривайте лук и морковь на сковороде около 5 минут.",
    "Добавьте свеклу и немного лимонного сока в сковороду . Обжаривайте ещё около 5 минут. Добавьте томатную пасту, перемешайте и оставьте на огне на 5-7 минут.",
    "Когда бульон сварится, выньте из него мясо и добавьте в кастрюлю нарезанную капусту. Через 5-10 минут добавьте картофель, нарезанный мелкими кубиками.",
    "Пока варится картофель, нарежьте мясо, и добавьте его в суп.",
    "Добавьте зажарку в суп и перемешайте. Закиньте мелко нарезанную зелень, накройте крышкой и варите около 10 минут.",
    "Для аромата можно добавить чеснок или перец. Борщ оставьте настаиваться под крышкой на 10 минут."};
    public static String classicsoupborshimg="https://firebasestorage.googleapis.com/v0/b/mealfinderrgb.appspot.com/o/classicborsh.jpg?alt=media&token=4ae7277e-5da4-4108-8bb6-e36513e711fc";
    public static String[] classicsoupborshlist={"Говядина","500 грамм","Свекла","320 грамм","Лук репчатый","150 грамм","Капуста","250 грамм","Морковь","150 грамм","Картофель","200 грамм","Томатная паста","1 ст. ложка","Сахар","1 ст. ложка"};
    public static String[] classicsoupborshinfo={"Классический борщ","Обед","Русская кухня","150 мин"};

    //sauces
    //Сметанно-чесночный соус
    public static String[] smetannogarlivsaucetext={"Помыть и нарезать укроп","Очистить и измельчить чеснок на мелкой тёрке","Добавить чеснок и укроп в сметану. Всё тщательно перемешать. Соус готов."};
    public static String smetannogarlivsauceimg="https://firebasestorage.googleapis.com/v0/b/mealfinderrgb.appspot.com/o/garlicsauce.jpg?alt=media&token=09fad62b-3dfb-45c0-9c26-9000578fcf86";
    public static String[] smetannogarlicsaucelist={"Сметана","275 грамм","Чеснок","5 зубчиков","Укроп","60 грамм","Соль","по вкусу","Перец","по вкусу"};
    public static String[] smetannogarlicsauceinfo={"Сметанно-чесночный соус","Обед","Румынская кухня","5 мин"};
    //Соус тартар
    public static String[] tartarsaucetext={"Вымыть и мелко нарезать укроп.","Очистить чеснок и измельчить на мелкой тёрке.","Нарезать солёные огурцы мелкими кубиками.","Добавить майонез и всё тщательно перемешать. Соус готов."};
    public static String tartartsauceimg="https://firebasestorage.googleapis.com/v0/b/mealfinderrgb.appspot.com/o/shrimp-fried-batter-with-tartar-sauce.jpg?alt=media&token=45b08d4a-7169-485c-8590-6fd677fa5105";
    public static String[] tartarsaucelist={"Огурцы солёные","100 грамм","Укроп","50 грамм","Майонез","200 грамм","Чеснок","2 зубчика","Перец","по вкусу"};
    public static String[] tartarsauceinfo={"Соус тартар","Обед","Французская кухня","5 мин"};
}
